// let x

// x = let y

// let a

// let b

// a = b

// ВЫРАЖЕНИЕ МОЖНО
//
// присвоить в переменную
// x = 1 + 1
//
// передать в функцию
// console.log(1 + 1)
//
// вернуть из функции
// function foo() {
//   return 1 + 1
// }

// выражение можно написать в круглые и квадратные скобки. и в ${}

// (1 + 1) * 2

// arr[1 + 1]

// `${1 + 1}`

// let array = [1, 2, 3]

// array[ if (true) { 1 } ]

// typeof - оператор

// , - оператор перечисления

let baz

console.log('foo', 'bar'), (baz = '')

// let x = 42, let y = 101
